[{"title": "AI Engineer (LLM + LangChain + RAG)", "link": "https://www.jobberman.com/listings/ai-engineer-llm-langchain-rag-evewrz", "description": "We are seeking an AI Engineer to build innovative LLM-powered applications using tools like LangChain, RAG, and vector databases. We're looking for a smart, passionate engineer eager to solve real-world problems with AI. Experience with Spring is a plus. Perfect for early-career talents ready to make an impact. | Description: We are seeking an AI Engineer to build innovative LLM-powered applications using tools like LangChain, RAG, and vector databases. We're looking for a smart, passionate engineer eager to solve real-world problems with AI. Experience with Spring is a plus. Perfect for early-career talents ready to make an impact."}, {"title": "Fullstack GenAI", "link": "https://www.jobberman.com/listings/fullstack-genai-python-ts-cloud-langchain-9jq8jn", "description": "We are looking for a highly skilled Senior Fullstack Developer to join our team doing Latest GenAI and ML based product such as Python, TS, Cloud, Langchain. Our developers cover the whole spectrum: frontend to back, GenAI to Devops. We do it all, and prefer people who master more than just a single area. | Description: We are looking for a highly skilled Senior Fullstack Developer to join our team doing Latest GenAI and ML based product such as Python, TS, Cloud, Langchain. Our developers cover the whole spectrum: frontend to back, GenAI to Devops. We do it all, and prefer people who master more than just a single area."}, {"title": "Creative Designer", "link": "https://www.jobberman.com/listings/creative-designer-uxui-dashboards-sites-animations-ads-vw6pwg", "description": "We are looking for a creative and talented Designer and animator. The ideal candidate will help us infuse our web application with micro animations and seamless page/component transition effects. Our goal is to enhance user engagement, making our applications more intuitive and enjoyable while maintaining an elegant an professional aesthetic. | Description: We are looking for a creative and talented Designer and animator. The ideal candidate will help us infuse our web application with micro animations and seamless page/component transition effects. Our goal is to enhance user engagement, making our applications more intuitive and enjoyable while maintaining an elegant an professional aesthetic."}, {"title": "Full Stack Developer", "link": "https://www.jobberman.com/listings/full-stack-developer-zp0g4g", "description": "We are looking for a skilled and versatile Full Stack Developer to join our development team. You’ll be responsible for designing, developing, and maintaining both the front-end and back-end components of our web applications. The ideal candidate has a passion for coding, a strong grasp of modern frameworks, and the ability to solve complex pro ... | Description: We are looking for a skilled and versatile Full Stack Developer to join our development team. You’ll be responsible for designing, developing, and maintaining both the front-end and back-end components of our web applications. The ideal candidate has a passion for coding, a strong grasp of modern frameworks, and the ability to solve complex pro ..."}, {"title": "Data Processing Staff", "link": "https://www.jobberman.com/listings/data-processing-staff-wp6xdz", "description": "We are looking for a detail-oriented Data Processing Staff member to manage, organize, and process data efficiently. The ideal candidate will be responsible for inputting, verifying, and analyzing data to support business operations and decision-making. This role requires strong attention to detail, accuracy, and proficiency with data managemen ... | Description: We are looking for a detail-oriented Data Processing Staff member to manage, organize, and process data efficiently. The ideal candidate will be responsible for inputting, verifying, and analyzing data to support business operations and decision-making. This role requires strong attention to detail, accuracy, and proficiency with data managemen ..."}, {"title": "Customer Success Lead", "link": "https://www.jobberman.com/listings/customer-success-lead-9jq4xx", "description": "As our Customer Success Lead, you'll ensure early adopters of our product achieve rapid value and become advocates for Protomated. This role focuses on onboarding, adoption, and gathering feedback from pioneer customers to inform product development in a market that's still being defined. | Description: As our Customer Success Lead, you'll ensure early adopters of our product achieve rapid value and become advocates for Protomated. This role focuses on onboarding, adoption, and gathering feedback from pioneer customers to inform product development in a market that's still being defined."}, {"title": "Senior DevOps", "link": "https://www.jobberman.com/listings/senior-devops-vw62r8", "description": "We are looking for an experienced DevOps / Solutions Architect to lead the design, deployment, and management of our infrastructure, supporting the development and maintenance of mobile applications and other digital platforms.\nThis role combines the technical responsibilities of DevOps with architectural oversight to ensure that our systems a ... | Description: We are looking for an experienced DevOps / Solutions Architect to lead the design, deployment, and management of our infrastructure, supporting the development and maintenance of mobile applications and other digital platforms.\nThis role combines the technical responsibilities of DevOps with architectural oversight to ensure that our systems a ..."}, {"title": "Website Designer", "link": "https://www.jobberman.com/listings/website-designer-pmexr2", "description": "We’re looking for a skilled web developer to join our team of innovative designers who are consistently raising the bar for creativity and user experience. The ideal candidate should be a talented artist who has extensive technical expertise and can work independently or with a team to create, maintain, and update client websites. | Description: We’re looking for a skilled web developer to join our team of innovative designers who are consistently raising the bar for creativity and user experience. The ideal candidate should be a talented artist who has extensive technical expertise and can work independently or with a team to create, maintain, and update client websites."}, {"title": "Business Developer", "link": "https://www.jobberman.com/listings/business-developer-jqen9z", "description": "We are seeking a dynamic Business Developer to join our team. The ideal candidate will be responsible for driving our business growth through identifying new sales leads, developing business relationships, and maintaining extensive knowledge of current market conditions. | Description: We are seeking a dynamic Business Developer to join our team. The ideal candidate will be responsible for driving our business growth through identifying new sales leads, developing business relationships, and maintaining extensive knowledge of current market conditions."}, {"title": "Product Owner", "link": "https://www.jobberman.com/listings/product-owner-84wjrz", "description": "As Product Owner for POWPA at YIP Online, you'll drive the growth and evolution of our eCommerce platform. You'll lead feature definition, prioritize initiatives, and align stakeholders and dev teams to deliver great user experiences and continuous product improvement. | Description: As Product Owner for POWPA at YIP Online, you'll drive the growth and evolution of our eCommerce platform. You'll lead feature definition, prioritize initiatives, and align stakeholders and dev teams to deliver great user experiences and continuous product improvement."}, {"title": "Technical Consultant - Senior Software Engineer", "link": "https://www.jobberman.com/listings/technical-consultant-senior-software-engineer-9jqewx", "description": "In this role, the Technical Consultant will represent our U.S. sales team in technical interviews for remote software engineering roles — primarily targeting jobs listed on LinkedIn and Indeed. | Description: In this role, the Technical Consultant will represent our U.S. sales team in technical interviews for remote software engineering roles — primarily targeting jobs listed on LinkedIn and Indeed."}, {"title": "UI/UX Designer", "link": "https://www.jobberman.com/listings/uiux-designer-84w6rr", "description": "We are looking to hire a UI/UX Designer to turn our software into easy-to-use products for our business. | Description: We are looking to hire a UI/UX Designer to turn our software into easy-to-use products for our business."}, {"title": "Mobile Developer", "link": "https://www.jobberman.com/listings/mobile-developer-q2e0xk", "description": "We are looking to hire a qualified Mobile Developer to join our engineering team. You will be working with our engineers to develop and maintain high-quality mobile applications. If you’re passionate about mobile platforms and translating code into user-friendly apps, we would like to meet you. | Description: We are looking to hire a qualified Mobile Developer to join our engineering team. You will be working with our engineers to develop and maintain high-quality mobile applications. If you’re passionate about mobile platforms and translating code into user-friendly apps, we would like to meet you."}, {"title": "Full Stack Developer", "link": "https://www.jobberman.com/listings/full-stack-developer-wp7405", "description": "We are looking to hire a Full Stack Developer to produce scalable software solutions. You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. | Description: We are looking to hire a Full Stack Developer to produce scalable software solutions. You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment."}, {"title": "Backend JavaScript Developer", "link": "https://www.jobberman.com/listings/backend-javascript-developer-npe68z", "description": "We are seeking to hire a talented Backend JavaScript Developer to join our team of developers. You will be responsible for building and designing highly scalable services and RESTful APIs. | Description: We are seeking to hire a talented Backend JavaScript Developer to join our team of developers. You will be responsible for building and designing highly scalable services and RESTful APIs."}, {"title": "Node.js BackEnd Developer", "link": "https://www.jobberman.com/listings/nodejs-backend-developer-9jq7xw", "description": "We are looking to hire a Node.js developer who will be responsible for writing server-side web application logic in JavaScript and/or variants of it, such as CoffeeScript, IcedCoffeeScript, etc. | Description: We are looking to hire a Node.js developer who will be responsible for writing server-side web application logic in JavaScript and/or variants of it, such as CoffeeScript, IcedCoffeeScript, etc."}]